/** 1
 * 입력: PM 11:00:00, 3
 * 입력: AM 11:00:00, 200,000
 * 
 * 출력: 23:00:03
 * 
 * 1 < N 200,000
 */


/** 2
 * 지그재그 배열
 * 입력: [1, 2, 3]
 * 출력: 1
 * 
 * 지그재그 배열이란, 증가 -> 감소 -> 증가 -> 감소를 반복하는 배열인데,
 * 입력이 지그재그 배열이 되도록, 원소를 추가해야하하는 횟수를 구하시오.
 * 
 * [1, 2, -10000, 3] => 1
 * ...
 * 
 */

/** 3
 * 드래곤 알 부화하기.
 * 철수가 집에 드래곤 알을 들고왔다.
 * 드래곤 알은 이틀 후에 부화하고, 드래곤이 된다.
 * 드래곤은 부화하자마자 알을 낳을 수 있다.
 * 드래곤은 알을 네번 낳으면, 죽는다.
 * 
 * n일 후 드래곤 알의 개수를 출력하시오.
 * 
 * dp,
 * Dragon, Egg
 * 
 */



/** 4
 * 12345678910111213141516... => 이어쓰기 수.
 * 
 * N이 입력될 때, 이어쓰기 수의 N번째 수를 맞추세요.
 * 10 => 1
 * 
 * 0 < N < 10,000,000
 * 
 */



/** 졸라 어려움 5
 *  A비커 용량, B비커 용량, C비커 용량,    만들어야할 리터 D
 * 입력: (3, 5, 7, 6)
 * 
 * 3 + 3 => 7
 */